"""
Дано целое число. Выведите его последнюю цифру.
Например, дано 200 - последняя цифра 0. Дано 123 - последняя
цифра 3. Дано 587 - последняя 7.
"""
number = 123
print("Число:", number)
print("Последняя цифра числа:", number % 10)
